bluekitchen/btstack/port/stm32-f4discovery-csr8x11/STM32F407xx.svd
        <register>
          <dim>3</dim><dimIncrement>0x20</dimIncrement><dimIndex>2,3,4</dimIndex><name>PCR%s</name>
          <displayName>PCR2</displayName>
          <description>PC Card/NAND Flash control register
          2</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <fields>
            <field>
              <name>ECCPS</name>
              <description>ECCPS</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>ECCPS</name><usage>read-write</usage><enumeratedValue><name>Bytes256</name><description>ECC page size 256 bytes</description><value>0</value></enumeratedValue><enumeratedValue><name>Bytes512</name><description>ECC page size 512 bytes</description><value>1</value></enumeratedValue><enumeratedValue><name>Bytes1024</name><description>ECC page size 1024 bytes</description><value>2</value></enumeratedValue><enumeratedValue><name>Bytes2048</name><description>ECC page size 2048 bytes</description><value>3</value></enumeratedValue><enumeratedValue><name>Bytes4096</name><description>ECC page size 4096 bytes</description><value>4</value></enumeratedValue><enumeratedValue><name>Bytes8192</name><description>ECC page size 8192 bytes</description><value>5</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TAR</name>
              <description>TAR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>TCLR</name>
              <description>TCLR</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>ECCEN</name>
              <description>ECCEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ECCEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>ECC logic is disabled and reset</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>ECC logic is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PWID</name>
              <description>PWID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PWID</name><usage>read-write</usage><enumeratedValue><name>Bits8</name><description>External memory device width 8 bits</description><value>0</value></enumeratedValue><enumeratedValue><name>Bits16</name><description>External memory device width 16 bits</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PTYP</name>
              <description>PTYP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PTYP</name><usage>read-write</usage><enumeratedValue><name>NANDFlash</name><description>NAND Flash</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PBKEN</name>
              <description>PBKEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PBKEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Corresponding memory bank is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Corresponding memory bank is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PWAITEN</name>
              <description>PWAITEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PWAITEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Wait feature disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Wait feature enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim><dimIncrement>0x20</dimIncrement><dimIndex>2,3,4</dimIndex><name>SR%s</name>
          <displayName>SR2</displayName>
          <description>FIFO status and interrupt register
          2</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>FEMPT</name>
              <description>FEMPT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            <enumeratedValues><name>FEMPT</name><usage>read-write</usage><enumeratedValue><name>NotEmpty</name><description>FIFO not empty</description><value>0</value></enumeratedValue><enumeratedValue><name>Empty</name><description>FIFO empty</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>IFEN</name>
              <description>IFEN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>IFEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt falling edge detection request disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt falling edge detection request enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ILEN</name>
              <description>ILEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>ILEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt high-level detection request disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt high-level detection request enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>IREN</name>
              <description>IREN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>IREN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt rising edge detection request disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt rising edge detection request enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>IFS</name>
              <description>IFS</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>IFS</name><usage>read-write</usage><enumeratedValue><name>DidNotOccur</name><description>Interrupt falling edge did not occur</description><value>0</value></enumeratedValue><enumeratedValue><name>Occurred</name><description>Interrupt falling edge occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ILS</name>
              <description>ILS</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>ILS</name><usage>read-write</usage><enumeratedValue><name>DidNotOccur</name><description>Interrupt high-level did not occur</description><value>0</value></enumeratedValue><enumeratedValue><name>Occurred</name><description>Interrupt high-level occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>IRS</name>
              <description>IRS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>IRS</name><usage>read-write</usage><enumeratedValue><name>DidNotOccur</name><description>Interrupt rising edge did not occur</description><value>0</value></enumeratedValue><enumeratedValue><name>Occurred</name><description>Interrupt rising edge occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PMEM2</name>
          <displayName>PMEM2</displayName>
          <description>Common memory space timing register
          2</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>MEMHIZ</name>
              <description>MEMHIZx</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MEMHOLD</name>
              <description>MEMHOLDx</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MEMWAIT</name>
              <description>MEMWAITx</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MEMSET</name>
              <description>MEMSETx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PATT2</name>
          <displayName>PATT2</displayName>
          <description>Attribute memory space timing register
          2</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>ATTHIZ</name>
              <description>ATTHIZx</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>ATTHOLD</name>
              <description>ATTHOLDx</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>ATTWAIT</name>
              <description>ATTWAITx</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>ATTSET</name>
              <description>ATTSETx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCR2</name>
          <displayName>ECCR2</displayName>
          <description>ECC result register 2</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>ECCx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PMEM3</name>
          <displayName>PMEM3</displayName>
          <description>Common memory space timing register
          3</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>MEMHIZ</name>
              <description>MEMHIZx</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MEMHOLD</name>
              <description>MEMHOLDx</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MEMWAIT</name>
              <description>MEMWAITx</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MEMSET</name>
              <description>MEMSETx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PATT3</name>
          <displayName>PATT3</displayName>
          <description>Attribute memory space timing register
          3</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>ATTHIZ</name>
              <description>ATTHIZx</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>ATTHOLD</name>
              <description>ATTHOLDx</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>ATTWAIT</name>
              <description>ATTWAITx</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>ATTSET</name>
              <description>ATTSETx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCR3</name>
          <displayName>ECCR3</displayName>
          <description>ECC result register 3</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>ECCx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PMEM4</name>
          <displayName>PMEM4</displayName>
          <description>Common memory space timing register
          4</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>MEMHIZ</name>
              <description>MEMHIZx</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MEMHOLD</name>
              <description>MEMHOLDx</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MEMWAIT</name>
              <description>MEMWAITx</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MEMSET</name>
              <description>MEMSETx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PATT4</name>
          <displayName>PATT4</displayName>
          <description>Attribute memory space timing register
          4</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>ATTHIZ</name>
              <description>ATTHIZx</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>ATTHOLD</name>
              <description>ATTHOLDx</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>ATTWAIT</name>
              <description>ATTWAITx</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>1</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
            <field>
              <name>ATTSET</name>
              <description>ATTSETx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>254</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PIO4</name>
          <displayName>PIO4</displayName>
          <description>I/O space timing register 4</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFCFCFCFC</resetValue>
          <fields>
            <field>
              <name>IOHIZx</name>
              <description>IOHIZx</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IOHOLDx</name>
              <description>IOHOLDx</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IOWAITx</name>
              <description>IOWAITx</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>IOSETx</name>
              <description>IOSETx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
