bluekitchen/btstack/port/stm32-f4discovery-csr8x11/STM32F407xx.svd
        <register>
          <name>SMPR1</name>
          <displayName>SMPR1</displayName>
          <description>sample time register 1</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SMP18</name>
              <description>Channel 18 sampling time selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP10"/>
            </field>
          <field><name>SMP17</name><description>Channel 17 sampling time selection</description><bitOffset>21</bitOffset><bitWidth>3</bitWidth><enumeratedValues derivedFrom="SMP10"/>
            </field>
            <field><name>SMP16</name><description>Channel 16 sampling time selection</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth><enumeratedValues derivedFrom="SMP10"/>
            </field>
            <field><name>SMP15</name><description>Channel 15 sampling time selection</description><bitOffset>15</bitOffset><bitWidth>3</bitWidth><enumeratedValues derivedFrom="SMP10"/>
            </field>
            <field><name>SMP14</name><description>Channel 14 sampling time selection</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth><enumeratedValues derivedFrom="SMP10"/>
            </field>
            <field><name>SMP13</name><description>Channel 13 sampling time selection</description><bitOffset>9</bitOffset><bitWidth>3</bitWidth><enumeratedValues derivedFrom="SMP10"/>
            </field>
            <field><name>SMP12</name><description>Channel 12 sampling time selection</description><bitOffset>6</bitOffset><bitWidth>3</bitWidth><enumeratedValues derivedFrom="SMP10"/>
            </field>
            <field><name>SMP11</name><description>Channel 11 sampling time selection</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><enumeratedValues derivedFrom="SMP10"/>
            </field>
            <field><name>SMP10</name><description>Channel 10 sampling time selection</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><enumeratedValues><name>SMP10</name><usage>read-write</usage><enumeratedValue><name>Cycles3</name><description>3 cycles</description><value>0</value></enumeratedValue><enumeratedValue><name>Cycles15</name><description>15 cycles</description><value>1</value></enumeratedValue><enumeratedValue><name>Cycles28</name><description>28 cycles</description><value>2</value></enumeratedValue><enumeratedValue><name>Cycles56</name><description>56 cycles</description><value>3</value></enumeratedValue><enumeratedValue><name>Cycles84</name><description>84 cycles</description><value>4</value></enumeratedValue><enumeratedValue><name>Cycles112</name><description>112 cycles</description><value>5</value></enumeratedValue><enumeratedValue><name>Cycles144</name><description>144 cycles</description><value>6</value></enumeratedValue><enumeratedValue><name>Cycles480</name><description>480 cycles</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            </fields>
        </register>
        <register>
          <name>SMPR2</name>
          <displayName>SMPR2</displayName>
          <description>sample time register 2</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SMP9</name>
              <description>Channel 9 sampling time selection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues derivedFrom="SMP0"/>
            </field>
          <field><name>SMP8</name><description>Channel 8 sampling time selection</description><bitOffset>24</bitOffset><bitWidth>3</bitWidth><enumeratedValues derivedFrom="SMP0"/>
            </field>
            <field><name>SMP7</name><description>Channel 7 sampling time selection</description><bitOffset>21</bitOffset><bitWidth>3</bitWidth><enumeratedValues derivedFrom="SMP0"/>
            </field>
            <field><name>SMP6</name><description>Channel 6 sampling time selection</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth><enumeratedValues derivedFrom="SMP0"/>
            </field>
            <field><name>SMP5</name><description>Channel 5 sampling time selection</description><bitOffset>15</bitOffset><bitWidth>3</bitWidth><enumeratedValues derivedFrom="SMP0"/>
            </field>
            <field><name>SMP4</name><description>Channel 4 sampling time selection</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth><enumeratedValues derivedFrom="SMP0"/>
            </field>
            <field><name>SMP3</name><description>Channel 3 sampling time selection</description><bitOffset>9</bitOffset><bitWidth>3</bitWidth><enumeratedValues derivedFrom="SMP0"/>
            </field>
            <field><name>SMP2</name><description>Channel 2 sampling time selection</description><bitOffset>6</bitOffset><bitWidth>3</bitWidth><enumeratedValues derivedFrom="SMP0"/>
            </field>
            <field><name>SMP1</name><description>Channel 1 sampling time selection</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth><enumeratedValues derivedFrom="SMP0"/>
            </field>
            <field><name>SMP0</name><description>Channel 0 sampling time selection</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><enumeratedValues><name>SMP0</name><usage>read-write</usage><enumeratedValue><name>Cycles3</name><description>3 cycles</description><value>0</value></enumeratedValue><enumeratedValue><name>Cycles15</name><description>15 cycles</description><value>1</value></enumeratedValue><enumeratedValue><name>Cycles28</name><description>28 cycles</description><value>2</value></enumeratedValue><enumeratedValue><name>Cycles56</name><description>56 cycles</description><value>3</value></enumeratedValue><enumeratedValue><name>Cycles84</name><description>84 cycles</description><value>4</value></enumeratedValue><enumeratedValue><name>Cycles112</name><description>112 cycles</description><value>5</value></enumeratedValue><enumeratedValue><name>Cycles144</name><description>144 cycles</description><value>6</value></enumeratedValue><enumeratedValue><name>Cycles480</name><description>480 cycles</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            </fields>
        </register>
        <register>
          <dim>4</dim><dimIncrement>0x4</dimIncrement><dimIndex>1,2,3,4</dimIndex><name>JOFR%s</name>
          <displayName>JOFR1</displayName>
          <description>injected channel data offset register
          x</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JOFFSET</name>
              <description>Data offset for injected channel
              x</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HTR</name>
          <displayName>HTR</displayName>
          <description>watchdog higher threshold
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>HT</name>
              <description>Analog watchdog higher
              threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LTR</name>
          <displayName>LTR</displayName>
          <description>watchdog lower threshold
          register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LT</name>
              <description>Analog watchdog lower
              threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR1</name>
          <displayName>SQR1</displayName>
          <description>regular sequence register 1</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>L</name>
              <description>Regular channel sequence
              length</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ16</name>
              <description>16th conversion in regular
              sequence</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ15</name>
              <description>15th conversion in regular
              sequence</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ14</name>
              <description>14th conversion in regular
              sequence</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ13</name>
              <description>13th conversion in regular
              sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR2</name>
          <displayName>SQR2</displayName>
          <description>regular sequence register 2</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SQ12</name>
              <description>12th conversion in regular
              sequence</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ11</name>
              <description>11th conversion in regular
              sequence</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ10</name>
              <description>10th conversion in regular
              sequence</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ9</name>
              <description>9th conversion in regular
              sequence</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ8</name>
              <description>8th conversion in regular
              sequence</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ7</name>
              <description>7th conversion in regular
              sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR3</name>
          <displayName>SQR3</displayName>
          <description>regular sequence register 3</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SQ6</name>
              <description>6th conversion in regular
              sequence</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ5</name>
              <description>5th conversion in regular
              sequence</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ4</name>
              <description>4th conversion in regular
              sequence</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ3</name>
              <description>3rd conversion in regular
              sequence</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ2</name>
              <description>2nd conversion in regular
              sequence</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SQ1</name>
              <description>1st conversion in regular
              sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>JSQR</name>
          <displayName>JSQR</displayName>
          <description>injected sequence register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JL</name>
              <description>Injected sequence length</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint>
            </field>
            <field>
              <name>JSQ4</name>
              <description>4th conversion in injected
              sequence</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
            <field>
              <name>JSQ3</name>
              <description>3rd conversion in injected
              sequence</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
            <field>
              <name>JSQ2</name>
              <description>2nd conversion in injected
              sequence</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
            <field>
              <name>JSQ1</name>
              <description>1st conversion in injected
              sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>18</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim><dimIncrement>0x4</dimIncrement><dimIndex>1,2,3,4</dimIndex><name>JDR%s</name>
          <displayName>JDR1</displayName>
          <description>injected data register x</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>JDATA</name>
              <description>Injected data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <displayName>DR</displayName>
          <description>regular data register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>Regular data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
