bluekitchen/btstack/port/stm32-f4discovery-csr8x11/STM32F407xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART5</name>
      <baseAddress>0x40005000</baseAddress>
      <interrupt>
        <name>UART5</name>
        <description>UART5 global interrupt</description>
        <value>53</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART7</name>
      <baseAddress>0x40007800</baseAddress>
      <interrupt>
        <name>UART4</name>
        <description>UART4 global interrupt</description>
        <value>52</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART8</name>
      <baseAddress>0x40007C00</baseAddress>
      <interrupt>
        <name>UART5</name>
        <description>UART5 global interrupt</description>
        <value>53</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ADC_Common</name>
      <description>Common ADC registers</description>
      <groupName>ADC</groupName>
      <baseAddress>0x40012300</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>ADC Common status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVR3</name>
              <description>Overrun flag of ADC3</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OVR1"/>
            </field>
            <field>
              <name>STRT3</name>
              <description>Regular channel Start flag of ADC
              3</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="STRT1"/>
            </field>
            <field>
              <name>JSTRT3</name>
              <description>Injected channel Start flag of ADC
              3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="JSTRT1"/>
            </field>
            <field>
              <name>JEOC3</name>
              <description>Injected channel end of conversion of
              ADC 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="JEOC1"/>
            </field>
            <field>
              <name>EOC3</name>
              <description>End of conversion of ADC 3</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="EOC1"/>
            </field>
            <field>
              <name>AWD3</name>
              <description>Analog watchdog flag of ADC
              3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="AWD1"/>
            </field>
            <field>
              <name>OVR2</name>
              <description>Overrun flag of ADC 2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="OVR1"/>
            </field>
            <field>
              <name>STRT2</name>
              <description>Regular channel Start flag of ADC
              2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="STRT1"/>
            </field>
            <field>
              <name>JSTRT2</name>
              <description>Injected channel Start flag of ADC
              2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="JSTRT1"/>
            </field>
            <field>
              <name>JEOC2</name>
              <description>Injected channel end of conversion of
              ADC 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="JEOC1"/>
            </field>
            <field>
              <name>EOC2</name>
              <description>End of conversion of ADC 2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="EOC1"/>
            </field>
            <field>
              <name>AWD2</name>
              <description>Analog watchdog flag of ADC
              2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues derivedFrom="AWD1"/>
            </field>
            <field>
              <name>OVR1</name>
              <description>Overrun flag of ADC 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>OVR1</name><usage>read-write</usage><enumeratedValue><name>NoOverrun</name><description>No overrun occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Overrun</name><description>Overrun occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>STRT1</name>
              <description>Regular channel Start flag of ADC
              1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>STRT1</name><usage>read-write</usage><enumeratedValue><name>NotStarted</name><description>No regular channel conversion started</description><value>0</value></enumeratedValue><enumeratedValue><name>Started</name><description>Regular channel conversion has started</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JSTRT1</name>
              <description>Injected channel Start flag of ADC
              1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JSTRT1</name><usage>read-write</usage><enumeratedValue><name>NotStarted</name><description>No injected channel conversion started</description><value>0</value></enumeratedValue><enumeratedValue><name>Started</name><description>Injected channel conversion has started</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>JEOC1</name>
              <description>Injected channel end of conversion of
              ADC 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>JEOC1</name><usage>read-write</usage><enumeratedValue><name>NotComplete</name><description>Conversion is not complete</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>Conversion complete</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>EOC1</name>
              <description>End of conversion of ADC 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>EOC1</name><usage>read-write</usage><enumeratedValue><name>NotComplete</name><description>Conversion is not complete</description><value>0</value></enumeratedValue><enumeratedValue><name>Complete</name><description>Conversion complete</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AWD1</name>
              <description>Analog watchdog flag of ADC
              1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AWD1</name><usage>read-write</usage><enumeratedValue><name>NoEvent</name><description>No analog watchdog event occurred</description><value>0</value></enumeratedValue><enumeratedValue><name>Event</name><description>Analog watchdog event occurred</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <displayName>CCR</displayName>
          <description>ADC common control register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TSVREFE</name>
              <description>Temperature sensor and VREFINT
              enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TSVREFE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Temperature sensor and V_REFINT channel disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Temperature sensor and V_REFINT channel enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>VBATE</name>
              <description>VBAT enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>VBATE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>V_BAT channel disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>V_BAT channel enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADCPRE</name>
              <description>ADC prescaler</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>ADCPRE</name><usage>read-write</usage><enumeratedValue><name>Div2</name><description>PCLK2 divided by 2</description><value>0</value></enumeratedValue><enumeratedValue><name>Div4</name><description>PCLK2 divided by 4</description><value>1</value></enumeratedValue><enumeratedValue><name>Div6</name><description>PCLK2 divided by 6</description><value>2</value></enumeratedValue><enumeratedValue><name>Div8</name><description>PCLK2 divided by 8</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DMA</name>
              <description>Direct memory access mode for multi ADC
              mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>DMA</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DMA mode disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Mode1</name><description>DMA mode 1 enabled (2 / 3 half-words one by one - 1 then 2 then 3)</description><value>1</value></enumeratedValue><enumeratedValue><name>Mode2</name><description>DMA mode 2 enabled (2 / 3 half-words by pairs - 2&amp;1 then 1&amp;3 then 3&amp;2)</description><value>2</value></enumeratedValue><enumeratedValue><name>Mode3</name><description>DMA mode 3 enabled (2 / 3 half-words by pairs - 2&amp;1 then 1&amp;3 then 3&amp;2)</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DDS</name>
              <description>DMA disable selection for multi-ADC
              mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DDS</name><usage>read-write</usage><enumeratedValue><name>Single</name><description>No new DMA request is issued after the last transfer</description><value>0</value></enumeratedValue><enumeratedValue><name>Continuous</name><description>DMA requests are issued as long as data are converted and DMA=01, 10 or 11</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DELAY</name>
              <description>Delay between 2 sampling
              phases</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>15</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MULTI</name>
              <description>Multi ADC mode selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            <enumeratedValues><name>MULTI</name><usage>read-write</usage><enumeratedValue><name>Independent</name><description>All the ADCs independent: independent mode</description><value>0</value></enumeratedValue><enumeratedValue><name>DualRJ</name><description>Dual ADC1 and ADC2, combined regular and injected simultaneous mode</description><value>1</value></enumeratedValue><enumeratedValue><name>DualRA</name><description>Dual ADC1 and ADC2, combined regular and alternate trigger mode</description><value>2</value></enumeratedValue><enumeratedValue><name>DualJ</name><description>Dual ADC1 and ADC2, injected simultaneous mode only</description><value>5</value></enumeratedValue><enumeratedValue><name>DualR</name><description>Dual ADC1 and ADC2, regular simultaneous mode only</description><value>6</value></enumeratedValue><enumeratedValue><name>DualI</name><description>Dual ADC1 and ADC2, interleaved mode only</description><value>7</value></enumeratedValue><enumeratedValue><name>DualA</name><description>Dual ADC1 and ADC2, alternate trigger mode only</description><value>9</value></enumeratedValue><enumeratedValue><name>TripleRJ</name><description>Triple ADC, regular and injected simultaneous mode</description><value>17</value></enumeratedValue><enumeratedValue><name>TripleRA</name><description>Triple ADC, regular and alternate trigger mode</description><value>18</value></enumeratedValue><enumeratedValue><name>TripleJ</name><description>Triple ADC, injected simultaneous mode only</description><value>21</value></enumeratedValue><enumeratedValue><name>TripleR</name><description>Triple ADC, regular simultaneous mode only</description><value>22</value></enumeratedValue><enumeratedValue><name>TripleI</name><description>Triple ADC, interleaved mode only</description><value>23</value></enumeratedValue><enumeratedValue><name>TripleA</name><description>Triple ADC, alternate trigger mode only</description><value>24</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CDR</name>
          <displayName>CDR</displayName>
          <description>ADC common regular data register for dual
          and triple modes</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA2</name>
              <description>2nd data item of a pair of regular
              conversions</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>DATA1</name>
              <description>1st data item of a pair of regular
              conversions</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
