bluekitchen/btstack/port/stm32-f4discovery-csr8x11/STM32F407xx.svd
        <register>
          <name>MACMIIDR</name>
          <displayName>MACMIIDR</displayName>
          <description>Ethernet MAC MII data register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MD</name>
              <description>MII data read from/written to the PHY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MACFCR</name>
          <displayName>MACFCR</displayName>
          <description>Ethernet MAC flow control
          register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FCB</name>
              <description>Flow control busy/back pressure activate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FCB</name><usage>read-write</usage><enumeratedValue><name>PauseOrBackPressure</name><description>In full duplex, initiate a Pause control frame. In half duplex, assert back pressure</description><value>1</value></enumeratedValue><enumeratedValue><name>DisableBackPressure</name><description>In half duplex only, deasserts back pressure</description><value>0</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TFCE</name>
              <description>Transmit flow control enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TFCE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>In full duplex, flow control is disabled. In half duplex, back pressure is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>In full duplex, flow control is enabled. In half duplex, back pressure is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>RFCE</name>
              <description>Receive flow control enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RFCE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Pause frames are not decoded</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>MAC decodes received Pause frames and disables its transmitted for a specified time</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>UPFD</name>
              <description>Unicast pause frame detect</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>UPFD</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>MAC detects only a Pause frame with the multicast address specified in the 802.3x standard</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>MAC additionally detects Pause frames with the station's unicast address</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PLT</name>
              <description>Pause low threshold</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PLT</name><usage>read-write</usage><enumeratedValue><name>PLT4</name><description>Pause time minus 4 slot times</description><value>0</value></enumeratedValue><enumeratedValue><name>PLT28</name><description>Pause time minus 28 slot times</description><value>1</value></enumeratedValue><enumeratedValue><name>PLT144</name><description>Pause time minus 144 slot times</description><value>2</value></enumeratedValue><enumeratedValue><name>PLT256</name><description>Pause time minus 256 slot times</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ZQPD</name>
              <description>Zero-quanta pause disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ZQPD</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Normal operation with automatic zero-quanta pause control frame generation</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>Automatic generation of zero-quanta pause control frames is disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PT</name>
              <description>Pause time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MACVLANTR</name>
          <displayName>MACVLANTR</displayName>
          <description>Ethernet MAC VLAN tag register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VLANTI</name>
              <description>VLAN tag identifier (for receive frames)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
            <field>
              <name>VLANTC</name>
              <description>12-bit VLAN tag comparison</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>VLANTC</name><usage>read-write</usage><enumeratedValue><name>VLANTC16</name><description>Full 16 bit VLAN identifiers are used for comparison and filtering</description><value>0</value></enumeratedValue><enumeratedValue><name>VLANTC12</name><description>12 bit VLAN identifies are used for comparison and filtering</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MACPMTCSR</name>
          <displayName>MACPMTCSR</displayName>
          <description>Ethernet MAC PMT control and status
          register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PD</name>
              <description>Power down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PD</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>All received frames will be dropped. Cleared automatically when a magic packet or wakeup frame is received</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MPE</name>
              <description>Magic packet enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MPE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No power management event generated due to Magic Packet reception</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable generation of a power management event due to Magic Packet reception</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WFE</name>
              <description>Wakeup frame enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WFE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No power management event generated due to wakeup frame reception</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Enable generation of a power management event due to wakeup frame reception</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MPR</name>
              <description>Magic packet received</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WFR</name>
              <description>Wakeup frame received</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GU</name>
              <description>Global unicast</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>GU</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Normal operation</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Any unicast packet filtered by the MAC address recognition may be a wakeup frame</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WFFRPR</name>
              <description>Wakeup frame filter register pointer reset</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WFFRPR</name><usage>read-write</usage><enumeratedValue><name>Reset</name><description>Reset wakeup frame filter register point to 0b000. Automatically cleared</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MACDBGR</name>
          <displayName>MACDBGR</displayName>
          <description>Ethernet MAC debug register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field><name>TFF</name><description>Tx FIFO full</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TFNE</name><description>Tx FIFO not empty</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TFWA</name><description>Tx FIFO write active</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>TFRS</name><description>Tx FIFO read status</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>MTP</name><description>MAC transmitter in pause</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>MTFCS</name><description>MAC transmit frame controller status</description><bitOffset>17</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>MMTEA</name><description>MAC MII transmit engine active</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>RFFL</name><description>Rx FIFO fill level</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>RFRCS</name><description>Rx FIFO read controller status</description><bitOffset>5</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>RFWRA</name><description>Rx FIFO write controller active</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>MSFRWCS</name><description>MAC small FIFO read/write controllers status</description><bitOffset>1</bitOffset><bitWidth>2</bitWidth></field>
            <field><name>MMRPEA</name><description>MAC MII receive protocol engine active</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            </fields>
        </register>
        <register>
          <name>MACSR</name>
          <displayName>MACSR</displayName>
          <description>Ethernet MAC interrupt status
          register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMTS</name>
              <description>PMT status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MMCS</name>
              <description>MMC status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MMCRS</name>
              <description>MMC receive status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MMCTS</name>
              <description>MMC transmit status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSTS</name>
              <description>Time stamp trigger status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACIMR</name>
          <displayName>MACIMR</displayName>
          <description>Ethernet MAC interrupt mask
          register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PMTIM</name>
              <description>PMT interrupt mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>PMTIM</name><usage>read-write</usage><enumeratedValue><name>Unmasked</name><description>PMT Status interrupt generation enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Masked</name><description>PMT Status interrupt generation disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TSTIM</name>
              <description>Time stamp trigger interrupt mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TSTIM</name><usage>read-write</usage><enumeratedValue><name>Unmasked</name><description>Time stamp interrupt generation enabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Masked</name><description>Time stamp interrupt generation disabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA0HR</name>
          <displayName>MACA0HR</displayName>
          <description>Ethernet MAC address 0 high
          register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x0010FFFF</resetValue>
          <fields>
            <field>
              <name>MACA0H</name>
              <description>MAC address0 high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MO</name>
              <description>Always 1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA0LR</name>
          <displayName>MACA0LR</displayName>
          <description>Ethernet MAC address 0 low
          register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>MACA0L</name>
              <description>0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA1HR</name>
          <displayName>MACA1HR</displayName>
          <description>Ethernet MAC address 1 high
          register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>MACA1H</name>
              <description>MACA1H</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MBC</name>
              <description>MBC</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>63</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SA</name>
              <description>SA</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SA</name><usage>read-write</usage><enumeratedValue><name>Destination</name><description>This address is used for comparison with DA fields of the received frame</description><value>0</value></enumeratedValue><enumeratedValue><name>Source</name><description>This address is used for comparison with SA fields of received frames</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AE</name>
              <description>AE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Address filters ignore this address</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Address filters use this address</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA1LR</name>
          <displayName>MACA1LR</displayName>
          <description>Ethernet MAC address1 low
          register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>MACA1L</name>
              <description>MACA1LR</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA2HR</name>
          <displayName>MACA2HR</displayName>
          <description>Ethernet MAC address 2 high
          register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>MACA2H</name>
              <description>MAC2AH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>65535</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MBC</name>
              <description>MBC</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>63</maximum></range></writeConstraint>
            </field>
            <field>
              <name>SA</name>
              <description>SA</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SA</name><usage>read-write</usage><enumeratedValue><name>Destination</name><description>This address is used for comparison with DA fields of the received frame</description><value>0</value></enumeratedValue><enumeratedValue><name>Source</name><description>This address is used for comparison with SA fields of received frames</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AE</name>
              <description>AE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Address filters ignore this address</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Address filters use this address</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MACA2LR</name>
          <displayName>MACA2LR</displayName>
          <description>Ethernet MAC address 2 low
          register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>MACA2L</name>
              <description>MACA2L</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
