bluekitchen/btstack/port/stm32-f4discovery-csr8x11/STM32F407xx.svd
        <register>
          <name>DMAOMR</name>
          <displayName>DMAOMR</displayName>
          <description>Ethernet DMA operation mode
          register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SR</name>
              <description>Start/stop receive</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SR</name><usage>read-write</usage><enumeratedValue><name>Stopped</name><description>Reception is stopped after transfer of the current frame</description><value>0</value></enumeratedValue><enumeratedValue><name>Started</name><description>Reception is placed in the Running state</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OSF</name>
              <description>Operate on second frame</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTC</name>
              <description>Receive threshold control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>RTC</name><usage>read-write</usage><enumeratedValue><name>RTC64</name><description>64 bytes</description><value>0</value></enumeratedValue><enumeratedValue><name>RTC32</name><description>32 bytes</description><value>1</value></enumeratedValue><enumeratedValue><name>RTC96</name><description>96 bytes</description><value>2</value></enumeratedValue><enumeratedValue><name>RTC128</name><description>128 bytes</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FUGF</name>
              <description>Forward undersized good frames</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FUGF</name><usage>read-write</usage><enumeratedValue><name>Drop</name><description>Rx FIFO drops all frames of less than 64 bytes</description><value>0</value></enumeratedValue><enumeratedValue><name>Forward</name><description>Rx FIFO forwards undersized frames</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FEF</name>
              <description>Forward error frames</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FEF</name><usage>read-write</usage><enumeratedValue><name>Drop</name><description>Rx FIFO drops frames with error status</description><value>0</value></enumeratedValue><enumeratedValue><name>Forward</name><description>All frames except runt error frames are forwarded to the DMA</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ST</name>
              <description>Start/stop transmission</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>ST</name><usage>read-write</usage><enumeratedValue><name>Stopped</name><description>Transmission is placed in the Stopped state</description><value>0</value></enumeratedValue><enumeratedValue><name>Started</name><description>Transmission is placed in Running state</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TTC</name>
              <description>Transmit threshold control</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>TTC</name><usage>read-write</usage><enumeratedValue><name>TTC64</name><description>64 bytes</description><value>0</value></enumeratedValue><enumeratedValue><name>TTC128</name><description>128 bytes</description><value>1</value></enumeratedValue><enumeratedValue><name>TTC192</name><description>192 bytes</description><value>2</value></enumeratedValue><enumeratedValue><name>TTC256</name><description>256 bytes</description><value>3</value></enumeratedValue><enumeratedValue><name>TTC40</name><description>40 bytes</description><value>4</value></enumeratedValue><enumeratedValue><name>TTC32</name><description>32 bytes</description><value>5</value></enumeratedValue><enumeratedValue><name>TTC24</name><description>24 bytes</description><value>6</value></enumeratedValue><enumeratedValue><name>TTC16</name><description>16 bytes</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FTF</name>
              <description>Flush transmit FIFO</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FTF</name><usage>read-write</usage><enumeratedValue><name>Flush</name><description>Transmit FIFO controller logic is reset to its default values. Cleared automatically</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TSF</name>
              <description>Transmit store and forward</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>TSF</name><usage>read-write</usage><enumeratedValue><name>CutThrough</name><description>Transmission starts when the frame size in the Tx FIFO exceeds TTC threshold</description><value>0</value></enumeratedValue><enumeratedValue><name>StoreForward</name><description>Transmission starts when a full frame is in the Tx FIFO</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DFRF</name>
              <description>Disable flushing of received frames</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSF</name>
              <description>Receive store and forward</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>RSF</name><usage>read-write</usage><enumeratedValue><name>CutThrough</name><description>Rx FIFO operates in cut-through mode, subject to RTC bits</description><value>0</value></enumeratedValue><enumeratedValue><name>StoreForward</name><description>Frames are read from Rx FIFO after complete frame has been written</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DTCEFD</name>
              <description>Dropping of TCP/IP checksum error frames disable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DTCEFD</name><usage>read-write</usage><enumeratedValue><name>Enabled</name><description>Drop frames with errors only in the receive checksum offload engine</description><value>0</value></enumeratedValue><enumeratedValue><name>Disabled</name><description>Do not drop frames that only have errors in the receive checksum offload engine</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAIER</name>
          <displayName>DMAIER</displayName>
          <description>Ethernet DMA interrupt enable
          register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIE</name>
              <description>Transmit interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TPSIE</name>
              <description>Transmit process stopped interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TBUIE</name>
              <description>Transmit buffer unavailable interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TJTIE</name>
              <description>Transmit jabber timeout interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROIE</name>
              <description>Receive overflow interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TUIE</name>
              <description>Transmit underflow interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RIE</name>
              <description>Receive interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBUIE</name>
              <description>Receive buffer unavailable interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPSIE</name>
              <description>Receive process stopped interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RWTIE</name>
              <description>Receive watchdog timeout interrupt enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETIE</name>
              <description>Early transmit interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FBEIE</name>
              <description>Fatal bus error interrupt enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERIE</name>
              <description>Early receive interrupt enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AISE</name>
              <description>Abnormal interrupt summary enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NISE</name>
              <description>Normal interrupt summary enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAMFBOCR</name>
          <displayName>DMAMFBOCR</displayName>
          <description>Ethernet DMA missed frame and buffer
          overflow counter register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MFC</name>
              <description>Missed frames by the controller</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>OMFC</name>
              <description>Overflow bit for missed frame counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MFA</name>
              <description>Missed frames by the application</description>
              <bitOffset>17</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>OFOC</name>
              <description>Overflow bit for FIFO overflow counter</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARSWTR</name>
          <displayName>DMARSWTR</displayName>
          <description>Ethernet DMA receive status watchdog timer
          register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RSWTC</name>
              <description>Receive status watchdog timer count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACHTDR</name>
          <displayName>DMACHTDR</displayName>
          <description>Ethernet DMA current host transmit
          descriptor register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HTDAP</name>
              <description>Host transmit descriptor address pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACHRDR</name>
          <displayName>DMACHRDR</displayName>
          <description>Ethernet DMA current host receive descriptor
          register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HRDAP</name>
              <description>Host receive descriptor address pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACHTBAR</name>
          <displayName>DMACHTBAR</displayName>
          <description>Ethernet DMA current host transmit buffer
          address register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HTBAP</name>
              <description>Host transmit buffer address pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACHRBAR</name>
          <displayName>DMACHRBAR</displayName>
          <description>Ethernet DMA current host receive buffer
          address register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HRBAP</name>
              <description>Host receive buffer address pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
