bluekitchen/btstack/port/stm32-f4discovery-csr8x11/STM32F407xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SAI1</name>
      <description>Serial audio interface</description>
      <groupName>SAI1</groupName>
      <baseAddress>0x40015800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster><dim>2</dim><dimIncrement>0x20</dimIncrement><dimIndex>A,B</dimIndex><name>CH%s</name><description>Cluster CH%s, containing ?CR1, ?CR2, ?FRCR, ?SLOTR, ?IM, ?SR, ?CLRFR, ?DR</description><addressOffset>0x4</addressOffset><register>
          <name>CR1</name>
          <displayName>ACR1</displayName>
          <description>SAI AConfiguration register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>MCKDIV</name>
              <description>Master clock divider</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Audio block mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>MODE</name><usage>read-write</usage><enumeratedValue><name>MasterTx</name><description>Master transmitter</description><value>0</value></enumeratedValue><enumeratedValue><name>MasterRx</name><description>Master receiver</description><value>1</value></enumeratedValue><enumeratedValue><name>SlaveTx</name><description>Slave transmitter</description><value>2</value></enumeratedValue><enumeratedValue><name>SlaveRx</name><description>Slave receiver</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>PRTCFG</name>
              <description>Protocol configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>PRTCFG</name><usage>read-write</usage><enumeratedValue><name>Free</name><description>Free protocol. Free protocol allows to use the powerful configuration of the audio block to address a specific audio protocol</description><value>0</value></enumeratedValue><enumeratedValue><name>Spdif</name><description>SPDIF protocol</description><value>1</value></enumeratedValue><enumeratedValue><name>Ac97</name><description>AC&#8217;97 protocol</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DS</name>
              <description>Data size</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>DS</name><usage>read-write</usage><enumeratedValue><name>Bit8</name><description>8 bits</description><value>2</value></enumeratedValue><enumeratedValue><name>Bit10</name><description>10 bits</description><value>3</value></enumeratedValue><enumeratedValue><name>Bit16</name><description>16 bits</description><value>4</value></enumeratedValue><enumeratedValue><name>Bit20</name><description>20 bits</description><value>5</value></enumeratedValue><enumeratedValue><name>Bit24</name><description>24 bits</description><value>6</value></enumeratedValue><enumeratedValue><name>Bit32</name><description>32 bits</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LSBFIRST</name>
              <description>Least significant bit
              first</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LSBFIRST</name><usage>read-write</usage><enumeratedValue><name>MsbFirst</name><description>Data are transferred with MSB first</description><value>0</value></enumeratedValue><enumeratedValue><name>LsbFirst</name><description>Data are transferred with LSB first</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CKSTR</name>
              <description>Clock strobing edge</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CKSTR</name><usage>read-write</usage><enumeratedValue><name>FallingEdge</name><description>Data strobing edge is falling edge of SCK</description><value>0</value></enumeratedValue><enumeratedValue><name>RisingEdge</name><description>Data strobing edge is rising edge of SCK</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>Synchronization enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>SYNCEN</name><usage>read-write</usage><enumeratedValue><name>Asynchronous</name><description>audio sub-block in asynchronous mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Internal</name><description>audio sub-block is synchronous with the other internal audio sub-block. In this case, the audio sub-block must be configured in slave mode</description><value>1</value></enumeratedValue><enumeratedValue><name>External</name><description>audio sub-block is synchronous with an external SAI embedded peripheral. In this case the audio sub-block should be configured in Slave mode</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MONO</name>
              <description>Mono mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MONO</name><usage>read-write</usage><enumeratedValue><name>Stereo</name><description>Stereo mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Mono</name><description>Mono mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>OUTDRIV</name>
              <description>Output drive</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>OUTDRIV</name><usage>read-write</usage><enumeratedValue><name>OnStart</name><description>Audio block output driven when SAIEN is set</description><value>0</value></enumeratedValue><enumeratedValue><name>Immediately</name><description>Audio block output driven immediately after the setting of this bit</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>SAIEN</name>
              <description>Audio block enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>SAIEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>SAI audio block disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>SAI audio block enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>DMAEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>DMA disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>DMA enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>NODIV</name>
              <description>No divider</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>NODIV</name><usage>read-write</usage><enumeratedValue><name>MasterClock</name><description>MCLK output is enabled. Forces the ratio between FS and MCLK to 256 or 512 according to the OSR value</description><value>0</value></enumeratedValue><enumeratedValue><name>NoDiv</name><description>MCLK output enable set by the MCKEN bit (where present, else 0). Ratio between FS and MCLK depends on FRL.</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>ACR2</displayName>
          <description>SAI AConfiguration register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>FTH</name>
              <description>FIFO threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>FTH</name><usage>read-write</usage><enumeratedValue><name>Empty</name><description>FIFO empty</description><value>0</value></enumeratedValue><enumeratedValue><name>Quarter1</name><description>1&#8260;4 FIFO</description><value>1</value></enumeratedValue><enumeratedValue><name>Quarter2</name><description>1&#8260;2 FIFO</description><value>2</value></enumeratedValue><enumeratedValue><name>Quarter3</name><description>3&#8260;4 FIFO</description><value>3</value></enumeratedValue><enumeratedValue><name>Full</name><description>FIFO full</description><value>4</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FFLUSH</name>
              <description>FIFO flush</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FFLUSH</name><usage>read-write</usage><enumeratedValue><name>NoFlush</name><description>No FIFO flush</description><value>0</value></enumeratedValue><enumeratedValue><name>Flush</name><description>FIFO flush. Programming this bit to 1 triggers the FIFO Flush. All the internal FIFO pointers (read and write) are cleared</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>TRIS</name>
              <description>Tristate management on data
              line</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUTE</name>
              <description>Mute</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MUTE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>No mute mode</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Mute mode enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MUTEVAL</name>
              <description>Mute value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MUTEVAL</name><usage>read-write</usage><enumeratedValue><name>SendZero</name><description>Bit value 0 is sent during the mute mode</description><value>0</value></enumeratedValue><enumeratedValue><name>SendLast</name><description>Last values are sent during the mute mode</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MUTECNT</name>
              <description>Mute counter</description>
              <bitOffset>7</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CPL</name>
              <description>Complement bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CPL</name><usage>read-write</usage><enumeratedValue><name>OnesComplement</name><description>1&#8217;s complement representation</description><value>0</value></enumeratedValue><enumeratedValue><name>TwosComplement</name><description>2&#8217;s complement representation</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COMP</name>
              <description>Companding mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>COMP</name><usage>read-write</usage><enumeratedValue><name>NoCompanding</name><description>No companding algorithm</description><value>0</value></enumeratedValue><enumeratedValue><name>MuLaw</name><description>&#956;-Law algorithm</description><value>2</value></enumeratedValue><enumeratedValue><name>ALaw</name><description>A-Law algorithm</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRCR</name>
          <displayName>AFRCR</displayName>
          <description>SAI AFrame configuration
          register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>FRL</name>
              <description>Frame length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSALL</name>
              <description>Frame synchronization active level
              length</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSDEF</name>
              <description>Frame synchronization
              definition</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FSPOL</name>
              <description>Frame synchronization
              polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>FSPOL</name><usage>read-write</usage><enumeratedValue><name>FallingEdge</name><description>FS is active low (falling edge)</description><value>0</value></enumeratedValue><enumeratedValue><name>RisingEdge</name><description>FS is active high (rising edge)</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FSOFF</name>
              <description>Frame synchronization
              offset</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            <enumeratedValues><name>FSOFF</name><usage>read-write</usage><enumeratedValue><name>OnFirst</name><description>FS is asserted on the first bit of the slot 0</description><value>0</value></enumeratedValue><enumeratedValue><name>BeforeFirst</name><description>FS is asserted one bit before the first bit of the slot 0</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SLOTR</name>
          <displayName>ASLOTR</displayName>
          <description>SAI ASlot register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FBOFF</name>
              <description>First bit offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SLOTSZ</name>
              <description>Slot size</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            <enumeratedValues><name>SLOTSZ</name><usage>read-write</usage><enumeratedValue><name>DataSize</name><description>The slot size is equivalent to the data size (specified in DS[3:0] in the SAI_xCR1 register)</description><value>0</value></enumeratedValue><enumeratedValue><name>Bit16</name><description>16-bit</description><value>1</value></enumeratedValue><enumeratedValue><name>Bit32</name><description>32-bit</description><value>2</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>NBSLOT</name>
              <description>Number of slots in an audio
              frame</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SLOTEN</name>
              <description>Slot enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            <enumeratedValues><name>SLOTEN</name><usage>read-write</usage><enumeratedValue><name>Inactive</name><description>Inactive slot</description><value>0</value></enumeratedValue><enumeratedValue><name>Active</name><description>Active slot</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <displayName>AIM</displayName>
          <description>SAI AInterrupt mask register2</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OVRUDRIE</name>
              <description>Overrun/underrun interrupt
              enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>OVRUDRIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MUTEDETIE</name>
              <description>Mute detection interrupt
              enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MUTEDETIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WCKCFGIE</name>
              <description>Wrong clock configuration interrupt
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WCKCFGIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FREQIE</name>
              <description>FIFO request interrupt
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FREQIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CNRDYIE</name>
              <description>Codec not ready interrupt
              enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CNRDYIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AFSDETIE</name>
              <description>Anticipated frame synchronization
              detection interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AFSDETIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LFSDETIE</name>
              <description>Late frame synchronization detection
              interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LFSDETIE</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Interrupt is disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Interrupt is enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
