bluekitchen/btstack/port/stm32-f4discovery-csr8x11/STM32F407xx.svd
        <register>
          <name>SR</name>
          <displayName>ASR</displayName>
          <description>SAI AStatus register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>OVRUDR</name>
              <description>Overrun / underrun</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>OVRUDRR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No overrun/underrun error</description><value>0</value></enumeratedValue><enumeratedValue><name>Overrun</name><description>Overrun/underrun error detection</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>MUTEDET</name>
              <description>Mute detection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>MUTEDETR</name><usage>read</usage><enumeratedValue><name>NoMute</name><description>No MUTE detection on the SD input line</description><value>0</value></enumeratedValue><enumeratedValue><name>Mute</name><description>MUTE value detected on the SD input line (0 value) for a specified number of consecutive audio frame</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WCKCFG</name>
              <description>Wrong clock configuration
              flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>WCKCFGR</name><usage>read</usage><enumeratedValue><name>Correct</name><description>Clock configuration is correct</description><value>0</value></enumeratedValue><enumeratedValue><name>Wrong</name><description>Clock configuration does not respect the rule concerning the frame length specification</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FREQ</name>
              <description>FIFO request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>FREQR</name><usage>read</usage><enumeratedValue><name>NoRequest</name><description>No FIFO request</description><value>0</value></enumeratedValue><enumeratedValue><name>Request</name><description>FIFO request to read or to write the SAI_xDR</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CNRDY</name>
              <description>Codec not ready</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CNRDYR</name><usage>read</usage><enumeratedValue><name>Ready</name><description>External AC&#8217;97 Codec is ready</description><value>0</value></enumeratedValue><enumeratedValue><name>NotReady</name><description>External AC&#8217;97 Codec is not ready</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>AFSDET</name>
              <description>Anticipated frame synchronization
              detection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>AFSDETR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No error</description><value>0</value></enumeratedValue><enumeratedValue><name>EarlySync</name><description>Frame synchronization signal is detected earlier than expected</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LFSDET</name>
              <description>Late frame synchronization
              detection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LFSDETR</name><usage>read</usage><enumeratedValue><name>NoError</name><description>No error</description><value>0</value></enumeratedValue><enumeratedValue><name>NoSync</name><description>Frame synchronization signal is not present at the right time</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>FLVL</name>
              <description>FIFO level threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>FLVLR</name><usage>read</usage><enumeratedValue><name>Empty</name><description>FIFO empty</description><value>0</value></enumeratedValue><enumeratedValue><name>Quarter1</name><description>FIFO &lt;= 1&#8260;4 but not empty</description><value>1</value></enumeratedValue><enumeratedValue><name>Quarter2</name><description>1&#8260;4 &lt; FIFO &lt;= 1&#8260;2</description><value>2</value></enumeratedValue><enumeratedValue><name>Quarter3</name><description>1&#8260;2 &lt; FIFO &lt;= 3&#8260;4</description><value>3</value></enumeratedValue><enumeratedValue><name>Quarter4</name><description>3&#8260;4 &lt; FIFO but not full</description><value>4</value></enumeratedValue><enumeratedValue><name>Full</name><description>FIFO full</description><value>5</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLRFR</name>
          <displayName>ACLRFR</displayName>
          <description>SAI AClear flag register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COVRUDR</name>
              <description>Clear overrun / underrun</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>COVRUDRW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the OVRUDR flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CMUTEDET</name>
              <description>Mute detection flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CMUTEDETW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the MUTEDET flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CWCKCFG</name>
              <description>Clear wrong clock configuration
              flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CWCKCFGW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the WCKCFG flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CCNRDY</name>
              <description>Clear codec not ready flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CCNRDYW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the CNRDY flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CAFSDET</name>
              <description>Clear anticipated frame synchronization
              detection flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CAFSDETW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the AFSDET flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>CLFSDET</name>
              <description>Clear late frame synchronization
              detection flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CLFSDETW</name><usage>write</usage><enumeratedValue><name>Clear</name><description>Clears the LFSDET flag</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <displayName>ADR</displayName>
          <description>SAI AData register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        </cluster></registers>
    </peripheral>
    <peripheral>
      <name>LTDC</name>
      <description>LCD-TFT Controller</description>
      <groupName>LTDC</groupName>
      <baseAddress>0x40016800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LCD_TFT</name>
        <description>LTDC global interrupt</description>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>LCD_TFT_1</name>
        <description>LTDC global error interrupt</description>
        <value>89</value>
      </interrupt>
      <registers>
        <cluster><dim>2</dim><dimIncrement>0x80</dimIncrement><dimIndex>1,2</dimIndex><name>LAYER%s</name><description>Cluster LAYER%s, containing L?CR, L?WHPCR, L?WVPCR, L?CKCR, L?PFCR, L?CACR, L?DCCR, L?BFCR, L?CFBAR, L?CFBLR, L?CFBLNR, L?CLUTWR</description><addressOffset>0x84</addressOffset><register>
          <name>CR</name>
          <displayName>L1CR</displayName>
          <description>Layerx Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLUTEN</name>
              <description>Color Look-Up Table Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>CLUTEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Color look-up table disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Color look-up table enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COLKEN</name>
              <description>Color Keying Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>COLKEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Color keying disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Color keying enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>LEN</name>
              <description>Layer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            <enumeratedValues><name>LEN</name><usage>read-write</usage><enumeratedValue><name>Disabled</name><description>Layer disabled</description><value>0</value></enumeratedValue><enumeratedValue><name>Enabled</name><description>Layer enabled</description><value>1</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WHPCR</name>
          <displayName>L1WHPCR</displayName>
          <description>Layerx Window Horizontal Position
          Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WHSPPOS</name>
              <description>Window Horizontal Stop
              Position</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
            <field>
              <name>WHSTPOS</name>
              <description>Window Horizontal Start
              Position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4095</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>WVPCR</name>
          <displayName>L1WVPCR</displayName>
          <description>Layerx Window Vertical Position
          Configuration Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WVSPPOS</name>
              <description>Window Vertical Stop
              Position</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>2047</maximum></range></writeConstraint>
            </field>
            <field>
              <name>WVSTPOS</name>
              <description>Window Vertical Start
              Position</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>2047</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CKCR</name>
          <displayName>L1CKCR</displayName>
          <description>Layerx Color Keying Configuration
          Register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CKRED</name>
              <description>Color Key Red value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>CKGREEN</name>
              <description>Color Key Green value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>CKBLUE</name>
              <description>Color Key Blue value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PFCR</name>
          <displayName>L1PFCR</displayName>
          <description>Layerx Pixel Format Configuration
          Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PF</name>
              <description>Pixel Format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>PF</name><usage>read-write</usage><enumeratedValue><name>ARGB8888</name><description>ARGB8888</description><value>0</value></enumeratedValue><enumeratedValue><name>RGB888</name><description>RGB888</description><value>1</value></enumeratedValue><enumeratedValue><name>RGB565</name><description>RGB565</description><value>2</value></enumeratedValue><enumeratedValue><name>ARGB1555</name><description>ARGB1555</description><value>3</value></enumeratedValue><enumeratedValue><name>ARGB4444</name><description>ARGB4444</description><value>4</value></enumeratedValue><enumeratedValue><name>L8</name><description>L8 (8-bit luminance)</description><value>5</value></enumeratedValue><enumeratedValue><name>AL44</name><description>AL44 (4-bit alpha, 4-bit luminance)</description><value>6</value></enumeratedValue><enumeratedValue><name>AL88</name><description>AL88 (8-bit alpha, 8-bit luminance)</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CACR</name>
          <displayName>L1CACR</displayName>
          <description>Layerx Constant Alpha Configuration
          Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CONSTA</name>
              <description>Constant Alpha</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCR</name>
          <displayName>L1DCCR</displayName>
          <description>Layerx Default Color Configuration
          Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DCALPHA</name>
              <description>Default Color Alpha</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DCRED</name>
              <description>Default Color Red</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DCGREEN</name>
              <description>Default Color Green</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
            <field>
              <name>DCBLUE</name>
              <description>Default Color Blue</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>255</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>BFCR</name>
          <displayName>L1BFCR</displayName>
          <description>Layerx Blending Factors Configuration
          Register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000607</resetValue>
          <fields>
            <field>
              <name>BF1</name>
              <description>Blending Factor 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>BF1</name><usage>read-write</usage><enumeratedValue><name>Constant</name><description>BF1 = constant alpha</description><value>4</value></enumeratedValue><enumeratedValue><name>Pixel</name><description>BF1 = pixel alpha * constant alpha</description><value>6</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>BF2</name>
              <description>Blending Factor 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            <enumeratedValues><name>BF2</name><usage>read-write</usage><enumeratedValue><name>Constant</name><description>BF2 = 1 - constant alpha</description><value>5</value></enumeratedValue><enumeratedValue><name>Pixel</name><description>BF2 = 1 - pixel alpha * constant alpha</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFBAR</name>
          <displayName>L1CFBAR</displayName>
          <description>Layerx Color Frame Buffer Address
          Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CFBADD</name>
              <description>Color Frame Buffer Start
              Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>4294967295</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CFBLR</name>
          <displayName>L1CFBLR</displayName>
          <description>Layerx Color Frame Buffer Length
          Register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CFBP</name>
              <description>Color Frame Buffer Pitch in
              bytes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>8191</maximum></range></writeConstraint>
            </field>
            <field>
              <name>CFBLL</name>
              <description>Color Frame Buffer Line
              Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>8191</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CFBLNR</name>
          <displayName>L1CFBLNR</displayName>
          <description>Layerx ColorFrame Buffer Line Number
          Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CFBLNBR</name>
              <description>Frame Buffer Line Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            <writeConstraint><range><minimum>0</minimum><maximum>2047</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
